[
    {
        "thumb": "https://www.thesprucecrafts.com/thmb/1dXMO6crkv8a5Ez8Peb0aO7Mxzk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/close-up-of-stamps-collection-and-magnifying-glass-116359212-5a8e23cefa6bcc003708ff62.jpg",
        "headline": "Selling an Inherited Stamp Collection",
        "sub_headline": "It may seem impossible to sell an inherited collection of stamps. If you're not a serious collector yourself, you won't know about this niche market. Having it assessed will need decisions to be made regarding how to sell it.",
        "sections": [
            {
                "title": "Know Your Collector",
                "image": "",
                "content": "Don't think that the amount and age of the stamps alone make the collection value. If the collection was assembled by a serious collector—let's assume for the purposes of argument that a serious collector is one who spent $50 to $100 per month over many years—as opposed to a casual collector who might purchase current issues at the post office and attend a few stamp shows annually, then don't expect much in the way of value.\n The condition, as well as types of stamps in the collection, will have a great impact on the value. Many old collections are made up largely of stamp packet material. Such stamp packets often contained stamps that were reprints of original stamps issued by their governments. These have little value."
            },
            
            {
                "title": "Appraising the Stamp Collection",
                "content": "You might find stamp catalogs that match your collection at your local library. Alternatively, you could identify and sell the stamps yourself on an online auction site like eBay. However, be prepared to invest time and effort if you have many older stamps. Modern stamps are fairly straightforward, but the variety of classic stamps requires a keen eye and philatelic knowledge that catalogs may not provide.\n\nBe cautious of catalog values, as they rarely reflect the actual selling price to a dealer. The condition of your stamps is crucial. A stamp with a high catalog value, say $1,000, will significantly decrease in worth if it has flaws. Damaged stamps—those with tears, mildew stains, or missing perforations—are nearly worthless. They might only be bought as placeholders by collectors, valued much lower until a better specimen is found.\n\nBefore sending your collection to an auction house, have it appraised by a local dealer. If you're unsure of its worth, a professional appraisal can save you time and money. The dealer may advise against auctioning if the collection isn't valuable enough. Expect to pay a small fee for a thorough examination.\n\nAlso, seek advice from friends who collect stamps. Many collectors enjoy examining collections in detail. Just ensure your friend is knowledgeable enough to identify valuable stamps and not miss anything significant. You could gift a few stamps to your friend, similar to how you would pay a dealer for their appraisal."
            },
            {
                "title": "Selling a Collection at Auction",
                "content": "Be cautious when selecting an auction house for your stamp collection. Many serious collectors leave recommendations for which auction houses their relatives should use. However, don't automatically go to the suggested auction house. Recently, three major philatelic auction houses faced scandals or went out of business due to illegal practices. Verify the auction house's credibility—often, a simple Google search will provide necessary information or a starting point for further checks to ensure the auctioneer is reputable.\n\nRemember the fees associated with selling your collection at auction. Typically, the auction house will take 10 to 15 percent of the hammer price. This fee is reasonable, considering the effort involved in preparing your collection for auction. Additionally, the auction house charges a fee to the buyer, ensuring they profit well from valuable collections."
            }
        ]
    },
    
    {
        "thumb": "https://www.thesprucecrafts.com/thmb/56zLWCNVBdU1aX-lC_20BUxKJec=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/old-postage-stamps-513673134-e5e3e82b2c6844148e3c2d12590ca998.jpg",
        "headline": "Why Not All Stamp Collections Are Valuable",
        "sub_headline": "One of the saddest moments in stamp collecting is when a dedicated collector goes to sell their collection, only to be told by a dealer that it is virtually worthless. How does this happen? Aren't all stamps valuable, especially the older ones? Not necessarily. The value of stamps is often misunderstood, and collectors can sometimes misinterpret market signals.",
        "sections": [
            {
                "title": "Your Stamps' Value",
                "content": "Many classic stamps, especially U.S. stamps, have similar designs, with differences often being minute printing variations or grills. As a new collector, you might see a high-priced stamp and mistakenly believe you have the same one, when in reality, yours is a less valuable version. The condition of the stamp is crucial. Stamps that appear valuable in catalogs may be worth far less due to their condition. The advice 'buy the best you can afford' is vital in stamp collecting. Inferior quality stamps are nearly worthless, and while you may have bought some at bargain prices, their resale value can be negligible—if they can be resold at all.\n\nIt is rare for a collector to enter the hobby and immediately buy stamps that will hold their value. While you can pay an expert to curate a collection for you, that removes the enjoyment of collecting. For collectors, not investors, there is a vast supply of classic stamps available from dealers. However, buying from dealers carries risks, and you might end up with some inferior stamps.\n\nIn the past, collectors often bought stamps directly from stamp shops, gaining quick education from reputable dealers. These honest dealers wouldn't sell poor quality stamps to experienced collectors, as their business depended on maintaining trust. They would often advise new collectors, emphasizing the importance of stamp condition."
            },
            
            {
                "title": "Be Happy With Your Stamps",
                "content": "Stamp collecting should be a joyful refuge. Unlike bottle cap or matchbook collecting, stamps have an inherent market, making it a more rewarding hobby. Creating a unique collection that reflects your personality can be enjoyable, but don't expect it to have significant resale value unless you invest substantially. Collecting piece by piece can be less financially painful, and you may be pleasantly surprised by the value of your collection as it grows.\n\nOne pitfall to avoid is using improper mounting or display methods. Valuable stamps can become worthless if mounted in albums with adhesive pages, which can damage the stamps over time. Even if you manage to remove a stamp without tearing it, adhesive can discolor and ruin the stamp's gum.\n\nIt's crucial to use archival-quality materials specifically designed for stamps. Products not intended for philatelic use can lead to irreversible damage, turning your prized collection into a tragedy. Reputable stamp and cover mounts are tested to ensure they are safe for stamps, preserving their condition and value."
            }

        ]
    },
    
    
    {
        "thumb": "https://www.thesprucecrafts.com/thmb/5HjAiQ6sQ5FV0W_QdpOyTX5WVQY=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/sb10062186b-001-56b748f65f9b5829f8380bd7.jpg",
        "headline": "Catalogs and Your Stamp Collection's Value",
        "sub_headline": "Stamp collectors rely heavily on catalogs, but it's important to understand that catalogs are guides, not definitive sources of stamp values. Unless the publisher, like Stanley Gibbons Ltd., is also a stamp retailer, catalogs should not be considered the final word on stamp value. Collectors often impress non-collectors by quoting high catalog values, knowing they've actually spent much less.\n\nCatalogs can sometimes lag behind market trends. For example, the skyrocketing values of stamps from China and India, driven by increasing demand, can outpace catalog updates. A casual look at asking prices on platforms like eBay reveals a significant discrepancy between catalog values and actual selling prices. This highlights the importance of viewing catalog values as estimates rather than guaranteed prices.",
        "sections": [
            {
                "title": "Sentiment Affects Stamps' Values",
                "image": "https://www.thesprucecrafts.com/thmb/WkpJy0I_tn3Xr1HUPAVYb_eO_e8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/charles-and-diana-stamp-458926539-5c3c8deec9e77c000101ca4a.jpg",
                "content": "The value of a stamp is influenced by numerous things. Sentiment is one of those things the catalogs are unable to measure until the market establishes the tone. Sentiment-based values can have erratic behavior. Consider the Princess Diana stamps and their response to the spotlight that the tragic loss of Lady Di brought. The Charles and Diana wedding stamps saw a spike in price before leveling off at a more affordable level.\n More recently, there was the blip of interest for the 50th anniversary of John Glenn's space flight in the Friendship 7, an event commemorated on a 4¢ stamp issued upon Glenn's return to earth in 1962.\n As regards the Glenn stamp, there is an aspect that catalogs do not record--the impact of first day covers on a stamp's valuation. In a strict sense, considering the small number of first-day covers in relation to the entire stamp issue there shouldn't be a correlation."
            },
            {
                "title": "Value of Stamps on Cover",
                "image": "https://www.thesprucecrafts.com/thmb/fDnFVDR6hsLEnWz-ROt_w3ZhyNA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/first-day-cover--grotte-prehistorique-de-lascaux--france--13th-april-1968-1052260956-5c3c8ead46e0fb0001bb054d.jpg",
                "content": "Although a number of first-day covers are listed in numerous catalogs, such as the Scott Specialized Catalog of United States Stamps and Covers, these lists do not account for the influence of FDC interest on the value of mint stamps. You can also get a value for stamps used on covers up until 1940 from Scott's Specialized. Naturally, postal history collectors adore these lists since they provide them with an estimate of the worth of their collections. Often, these objects' selling prices are more in line with catalog value than the stamps themselves."
            },
            {
                "title": "Today's Potential Cover Rarities",
                "image": "",
                "content": "This should be a warning for those who think the collection of modern postal history is a dead end. Collecting current mail is a useless activity; it may turn out to be just the opposite. In fact, collectors may someday find themselves looking at rare items that are today just mail. After all, stamps are seldom used on mail: when they are it is almost an anomaly.\n Some enterprising philatelic publisher could do well by producing a catalog showing the number of stamps used on the cover and offering their values--only as a guide of course. It is beginning to look, in 2012 as if these will be as rare--perhaps even rarer--than classic stamps that were issued in much fewer numbers than current stamps used on covers. Interestingly, stamp collection seems to have come full circle, and with rarities being created right under our noses."
            }
        ]
    },
    
    {
        "thumb": "https://www.thesprucecrafts.com/thmb/XSmrliTI05-YflC1q2qjz_nuEFo=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/air-mail-cover-104634143-58448eb03df78c02301519c7.jpg",
        "headline": "The Value of First Day Covers for Stamp Collectors",
        "sub_headline": "Many stamp collectors spend a lot of time and money going to the post office and buying new stamps. This is common with first-day-of-issue stamps. They get them, put them on clean white blank envelopes, and send them away for a first-day-of-issue cancellation. These are called first-day covers (FDC) and, traditionally, have been all the rage in the stamp collecting business.\nUnfortunately, there has been a dramatic shift in the value of first-day covers. Over the years, collectors have made it clear that they prefer their first-day covers with cachets.",
        "sections": [
            {
                "title": "Added Value of Cachets",
                "content": "A cachet is an informative illustration usually on the left-hand side of an envelope or postcard. The cachet is designed to be attractive, educational, or humorous and supports the stamp by usually giving a little information about the featured stamp. For example, a 2003 stamp featuring the American Purple Heart Award had an accompanying postcard with an illustrated cachet showing three soldiers carrying a fourth wounded comrade.\n Overall, cachets covering all or most of the envelope have become popular. The cachet trend began in the early 1900s and is reminiscent of 19th-century advertising design. Hand-painted artist covers usually command a premium over mass-produced cachets, such as those marketed by Artcraft, Artmaster, Fleetwood, and other popular brands.\n\nAs supply and demand dictate the price, the limited-edition independent artist-produced cover—almost without exception—sells for more than their numerous commercial counterparts.\nThe one certainty in the world of first-day cover collecting is that blank first-day covers are virtually worthless in today's stamp collecting marketplace. In general, only stamps canceled with the first-day date are deemed collectible without a cachet. The First Day of Issue cancellation didn't yet exist before the middle 1920s—prior to the era when the cacheted cover came into vogue."
            },
            {
                "title": "First Day Covers' Past and Future",
                "content": "Stamp dealer and publisher George Linn created the first first-day cover when he developed a simple text cachet for the Harding Memorial stamp issue of 1926. From those humble beginnings, the collecting of first-day covers grew into a market with sales in the millions of dollars.\n\nBut collectors can take heart: If you are of an artistic bent, you might consider putting your own stamp-related artwork on a cover. Thanks to the ease of printing with computers we are in the age of the add-on cachet. If you can draw, print, and paint, your first-day cover collection might not come up blank after all. FDC collectors always invite a good artist into the fold and if conditions are right, you might become the next cachet star.\n Beware though, as computers can be used to create add-on cachets for earlier (1930s and 1940s) uncacheted first-day covers. While legitimate cachets have been identified and cataloged by Michael Mellone and Earl Planty, the uninformed collector may be fooled into paying high prices for covers that appear to be classics but are modern creations.\nAs printing methods have become more sophisticated in recent years, the approximation of old cachets has become easy to accomplish. Most legitimate producers will note when their covers contain an add-on cachet, though the collector of older first-day covers should do a bit of research to make sure they are adding the real thing to their collection when they purchase from first-day cover dealers.\nTo learn more about the ins and outs of first-day collecting, a great resource is the American First Day Cover Society."
            }

        ]
    },
    
    
    {
        "thumb": "https://staticapp.icpsc.com/icp/loadimage.php/mogile/1623227/96419e8772f7c2dcc777a25ca95f46ab/image/jpeg",
        "headline": "How Stamps are Made",
        "sub_headline": "Postage stamps are considered to be more than a mere payment for mail service they serve as a means of communication through which many countries around the world have recorded important events, reminisced history, celebrated holidays, described interesting facts, and honored worthy individuals.",
        "sections": [
            {
                "title": "Early Stamps",
                "image": "",
                "content": "The very first postage stamp issued in 1840 in Great Britain, which showed a portrait of Queen Victoria, is known as the Penny Black. Typically, most stamps produced in the early times feature one color only. For instance, in the United States, they issued single-colored stamps up until 1869. Multicolored stamps only started to become popular in the 1920s.\n The early stamps issued along with the Penny Black had to be separated using scissors, since perforated stamps in England weren't introduced until 1854. In the United States, perforated stamps started appearing in 1857."
            },
            
            {
                "title": "How are Stamps Made",
                "image": "",
                "content": "In the early times, stamps were printed on sheets of paper which were fed into presses one by one. Today, the paper used comes on rolls. Two types of paper are mainly used to print stamps Laid paper, which has ribbed lines, and Wove paper, which comes without ribbed lines.\n The United States only use wove paper for their stamps, whereas other countries use both types.\n The paper is delivered to the manufacturing facility, with the glue or gum already applied."
            },
            
            {
                "title": "The Printing Process",
                "image": "https://staticapp.icpsc.com/icp/loadimage.php/mogile/1623227/d95cce195ba39ec579bd82667cadfd09/image/jpeg",
                "content": "Intaglio printing process the oldest method of making stamps. This is a highly time consuming printing method, but it produces stamps with very distinct and vivid images, which is one of the reasons this process has not been discontinued completely, despite of modern, faster and cheaper printing methods being available. The intaglio method involves scratching, etching or engraving an image on a printing plate which then transfers that image onto paper. Intaglio also involves the gravure process, in which the image is put photographically onto the plate, and the image is then etched into the plate.\n Offset printing process this is much less expensive compared to intaglio printing, and still offset printing can actually produce high quality results. Offset printing has hence become the common preference for most stamps these days. Using the offset printing method, an image is initially created on an aluminum plate photo-chemically. After it has been attached to the printing press, the plate is alternately submerged in water and ink. The photochemical image gets ink, while the non-image areas are moistened with water, acting as an ink-repellant. This ensures that only the image will be transferred to the paper. Afterwards, the plate is pressed against a rubber blanket' that carries a reverse view of the final image. The rubber blanket then touches the paper, thereby producing the final image on the stamp.\n Depending on the type of production, perforations can be made during the printing process with the use of an adjacent equipment or, by applying external machinery after printing. The most commonly used practice is, to perforate the stamps as part of the printing process. When the perforations are done later, the stamp sheets have to be removed from the printer and placed in the machinery used for perforations. This added layer of complexity to the process increases the risk of errors.\n Stamps always undergo a quality control at every stage of the printing process, and only rarely are errors missed here. This is the reason why stamps with errors are so rare, and why they are equally expensive."
            }

        ]
    },
    
    {
        "thumb": "https://www.stampworld.com/media/pages/pile_of_stamps.jpg",
        "headline": "Stamp Values: How Much are My Stamps Worth?",
        "sub_headline": "One of the most frequently asked inquiries in the world of stamps and stamp collecting is, naturally, what the stamps are worth. Another common query is:What is the value of my stamps?It's possible that you began collecting stamps when you were young, that you received a lovely collection from your parents, grandparents, or other relatives, or that you came across an intriguing collection at a yard sale. Regardless of how you came to possess your current stamp collection, the issue still stands: How much are my stamps worth? How can I calculate the values of the stamps in my collection?\n\nStamp collecting is done for a variety of purposes. Naturally, the goal of every stamp collector is to eventually have valuable stamps in their collection that could fetch high prices. If this is how you think, you are going to be shocked to learn that approximately 98% of all stamps are only worth the handling/shipping charges. This is a harsh fact regarding stamp collecting. The fact that just 2% of stamps have values—1% are valued at $10 to $100 or more, and the remaining 1% are extremely valuable (the rare and famous stamps)—makes the situation much more intimidating.",
        "sections": [
            {
                "title": "How to Determine Stamp Values",
                "image": "",
                "content": "If you are planning to sell your stamps or you are just plain curious to know what your collection's stamp values are, then you have 5 options: Determine the stamp values by yourself, check out a printed book as reference, research the stamp values via the Internet, attend a stamp show, or take it to a stamp expert or dealer who offers professional stamp appraisal services to help you determine the stamp values of your collection."
            },
            
            {
                "title": "Option 1: Find out the Stamp Values by Yourself",
                "image": "",
                "content": "Identify the stamp\nFind out when was the stamp issued\nKnow the stamp's age and material used\n Determine the centering of the design\n Check the stamp's gum\n Determine the condition of the perforations\nSee if the stamp has been cancelled or not Find out the rarity of the stamp\n\nAssess the stamp's condition - Stamp grade is expressed in 3 words: sound (stamp with no imperfections), faulty (has minor imperfections such as a small crease at the corner), or defective (has major imperfections such as huge creases, abrasions, pinholes, or stains). Stamp condition is further divided into 7 levels: extremely fine, very fine, fine, good, average, fair, and below average.\nCheck out the demand for the stamp - No matter how many rare stamps you have in excellent condition, you won't get a good price for it if it is not highly sought after by stamp collectors."
            },
            
            {
                "title": "Option 2: Check out a Printed Reference",
                "image": "",
                "content": "By reading the contents of a stamp catalogue or encyclopedia, you can learn about the stamp values and history of the stamps as well. Some stamp catalogues include the Stanley Gibbons Stamp Catalogue, The Stamp Collector's Encyclopedia by R.J. Sutton, The Encyclopedia of United States Stamps and Stamp Collecting, and many more."
            },
            {
                "title": "Research the Stamp Values via the Internet",
                "image": "",
                "content": "Thankfully, there are many sites you can find on the Internet that can help you figure out the stamp values of individual stamps and/or your stamp collection. Auction sites, stamp dealer sites, stamp forum sites, and stamp sites put up by stamp collectors and enthusiasts can easily be found online and these can give you an idea of the current market price of a particular stamp. You can easily and quickly find stamp values at StampWorld.com."
            },
            {
                "title": "Option 4: Attend a Stamp Show",
                "image": "",
                "content": "Attending a stamp show or two shall give you the chance to see the current market's stamp values for different stamps. Going to a stamp show also allows you to talk with other stamp collectors and stamp enthusiasts, and some of them may likely give you their opinions regarding your collection's stamp values."
            },
            {
                "title": "Option 5: Find out the Stamp Values via a knowledgeable Stamp Expert, Dealer or Appraiser",
                "image": "https://www.stampworld.com/media/pages/determine_stamp_values.jpg",
                "content": "A lot of serious stamp collectors agree that the best way to find out the stamp values of your stamp collection is to have it appraised professionally. There are stamp experts or dealers that offer stamp appraisal services in exchange for a fee. There are some stamp dealers/appraisers who charge you a fee, and if interested, they then try to buy your collection and deduct the fee from it.\n You can find reputable local stamp dealers and appraisers that can help you determine your collection's stamp values."
            },
            
            {
                "title": "Determining Stamp Values Take Time, Effort and Research",
                "image": "",
                "content": "Determining the stamp values of stamp collections, old stamps and new stamps depend highly on what kinds of stamps they are. There are many and varied steps on how to figure out stamp values and how much the stamps are actually worth.\nThe only surefire way to know the correct stamp values on your own is to learn how to thoroughly evaluate your collection, and of course, this takes some time, effort and a whole lot of research."
            }
        ]
    },

    
    {
        "thumb": "https://stamp-one.com/cms-data/gallery/hipwig/c132-flyer.jpg",
        "headline": "French Stamps - A Collectors Favorite",
        "sub_headline": "French stamps captivate collectors with their artistic beauty and historical significance. From the classic Ceres and Napoleon issues to modern commemoratives, each stamp showcases France's rich cultural heritage. Prized for their intricate designs and craftsmanship, French stamps offer a fascinating glimpse into the nation's history and art, making them a beloved pursuit for philatelists worldwide.",
        "sections": [
            {
                "title": "The Allure of French Stamps: A Journey from the Ceres Series to Twentieth Century Commemoratives",
                "image": "",
                "content": "France has always been an interesting country for a variety of reasons, and this also counts for stamp collectors. France might not have been the first country to issue stamps, but they weren't far behind. The first French stamps were issued on January 1st, 1849 by the Second French Republic. The first series of stamps issued feature the Roman goddess of agriculture and fertility, Ceres. The initial drawing was done by Jacques-Jean Barre, and the stamps are denominated between 10 cents and 1 franc. All the stamps can be seen in our catalogue, by clicking the images.\n As the Ceres stamps were the first to be issued by France, the theme has been utilized again over time, and it has been featured in several different eras, including for the 1937 philatelic exhibition in Paris, the PEXIP.\n In general, France is favored by collectors, because of the history, but also because they are believed to have some of the most beautiful commemorative stamps in the world. Especially their editions from the twentieth century are popular. For instance we have this issue from 1927, which commemorates the visit from the American Legion."
            },
            
            {
                "title": "",
                "image": "https://staticapp.icpsc.com/icp/loadimage.php/mogile/1623227/041104a6d6db592f4e567a764183bf6c/image/jpeg",
                "content": "This set contains two stamps, a red and a blue version, with denominations of 90 cents, and 150 cents respectively. These stamps depict an influencial leader from both countries - one is Marqius de Lafayette, a Frenchman, who played a role in the American Revolution as well as the French Revolution, and also known as `The Hero of Two Worlds`. The other is George Washington, one of the Founding Fathers of The United States, and served as the first president of The United States of America.\n n the later years, the French postal service has had a tendency to produce a very large number of stamps every year, making it difficult for collectors to get a full French collection of stamps. Up until the 1970's, the French postal service issued roughly 400 stamps every decade. Since then, they have picked up the pace, and since 2010, more than 1700 stamps have been issued already. Although this might sound overwhelming, a French collection is still interesting, as the focus from the French postal service has been on producing thematic stamps."
            },
            
            {
                "title": "",
                "image": "https://staticapp.icpsc.com/icp/loadimage.php/mogile/1623227/4c71fcbd999cc648ce2628e71617639b/image/jpeg",
                "content": "With so many beautiful stamps to choose from, it can be difficult to highlight a single one. However, we tend to favour this souvenir sheet from 2010. It is part of a series on European capitals, and depicts some of the most famous parts of Paris. All four stamps are denominated at 0.58."
            }
        ]
    },
    
    
    {
        "headline": "Why people collect stamps?",

        "thumb": "https://www.stampworld.com/media/pages/simply_for_joy_fun_or_enjoyment.jpeg",
        "sub_headline": "A stamp collector acquires and collects stamps for many different reasons. Believe it or not, stamp collecting is still considered one of the most popular pastimes throughout the world. There are approximately 20+ million stamp collectors worldwide.\nDo you collect stamps? Why? Below are some of the most common reasons why people collect stamps.",
        "sections": [
            {
                "title": "Simply for joy, fun or enjoyment",
                "image": "https://cdn.britannica.com/00/129300-050-EB4B0345/stamp-collecting-book.jpg",
                "content": "All stamp collectors agree (even if not everyone admits it) that what motivates them to collect stamps is the pure simple joy they feel when collecting. The process of searching, locating and buying common stamps, new stamps, old stamps, rare stamps, or any other types of stamps which are needed in order to complete a specific type of stamp collection gives the stamp collector a sense of pride, success and accomplishment. For some people, just the simple and pure fun of the hunt (similar to treasure hunting), and the moment of actually finding and successfully acquiring a particular stamp is a good enough reason to collect stamps\nStamp collectors enjoy the moment when they get praised by family, friends, and other collectors regarding their stamp collections at stamp exhibits. Similarly, stamp collectors who put up personal websites showing their collection love the feeling of joy every time someone makes a positive feedback about their stamps.\nThere are those who collect stamps simply because they are intrigued and interested on the various pictures, designs, and colors they see on them. Just like a person who collects antiques or paintings, these individuals do so simply for their visual appeal and the simple joy and satisfaction they feel whenever they look at their stamp collection."
            },
            
            {
                "title": "Affordable and everyone can buy them",
                "image": "https://www.stampworld.com/media/pages/everyone_can_buy_stamps.jpg",
                "content": "People collect stamps because it is a cheap/affordable hobby, and that everyone can actually buy them. Click here to Buy Stamps. Most of us look for things that are interesting but affordable, especially during times of recession. It may sound unreal, but people nowadays, despite the presence of hi-tech stuff, are going back to old crafts like crocheting, knitting, gardening, cupcake baking, and of course, stamp collecting. The so-called old-fashioned hobbies are coming back and they are now regarded as cool."
            },
            
            {
                "title": "Educational benefits and historical value of stamps",
                "image": "https://www.stampworld.com/media/pages/educational_benefits_and_historical_value_of_stamps.jpg",
                "content": "People collect stamps because these small pieces of paper represent history and a whole lot more, actually. It teaches and educates people about history, art, geography, architecture, environment, mythology, movies, music, religion, culture, science and technology, modes of transport, space, sports, aviation, animals and plants, famous people, events, and many more. For some individuals, collecting stamps is based on the desire to acquire and keep a living history of their country. Rare stamps that are more than a hundred years old can help one to obtain a piece of living history right at their fingertips."
            },
            
            {
                "title": "A way to connect or keep in touch with people abroad",
                "image": "https://www.stampworld.com/media/pages/connect_with_people_abroad.jpg",
                "content": "People collect stamps for the very reason that it connects them to people from other countries all over the world -- pen pals and relatives who live abroad. For a small amount of money, thanks to postage stamps, you can send a letter to any place on earth, even if it is the farthest and most desolate area where humans might live. The existence of stamps and letters brings mankind closer together. Believe it or not, the concept of having pen pals still exist up to this day, albeit a bit modern (since now they can communicate quickly via emails and social media sites). However, when sending or receiving handwritten letters and packages, postage stamps will be needed, and it is one method for someone to collect stamps along the way. As for your relatives abroad, you can collect stamps from the packages, letters, and postcards they send. Not only do you get to know that your relatives are doing fine abroad, but you also get to collect stamps to add to your collection."
            },
            
            {
                "title": "A great way to meet new friends who share a common interest",
                "image": "https://www.stampworld.com/media/pages/fun_stamp_collector.jpg",
                "content": "When people collect stamps, chances are that they will meet new friends who share a common interest during their stamp collecting journey. Therefore, we can assume that some people who choose to collect stamps as one of their hobbies do so for the prospect of making new friends and the chance to share with others their experiences and knowledge about collecting stamps. There are some who collect stamps simply because it opens up the opportunity for them to meet and befriend other people from around the world. With lots of conferences specially put up for showcasing stamp collections that are held every year throughout many countries and the creation of the many forums and websites dedicated to stamps online, it is absolutely possible for a stamp collector to build his or her own circle of friends based around this hobby."
            },
            
            {
                "title": "To be passed on to the next generation",
                "image": "https://www.stampworld.com/media/pages/to_be_passed_on_to_the_next_generation.jpg",
                "content": "Some people collect stamps for the reason that they want to leave a 'personal' legacy to their children. You may give a personal tour of your stamp collection to your children. Show and tell them how many years of joy it has given you. Depending on your children's perspective in life and if you get lucky, they might even want to continue your collection."
            },
            
            {
                "title": "Sentimental value",
                "image": "https://www.stampworld.com/media/pages/sentimental_value.jpg",
                "content": "For sure, many people can relate to this scenario. If you are one of those who collected stamps as a kid, then you will definitely feel and remember some good ol' nostalgic memories of your childhood. Probably you have inherited a stamp collection from your parents, grandparents, or other relatives. If you do, you will surely fondly remember yourself sitting at the table, scouring over stamps with your mom or dad, or your grandparents. The passion of collecting stamps is transferred from parent to child, and oftentimes, to grandchild."
            },
            
            {
                "title": "To commemorate special events",
                "image": "https://www.stampworld.com/media/pages/commemorative_stamps_pope_francis.jpg",
                "content": "There are some people who collect stamps for the reason of commemorating special events. Those who are extremely interested in history, called history buffs, may stick to collecting stamps that are specifically designed to commemorate a variety of important events in the history. If a stamp collector is passionate about soccer/football, then he would most likely collect stamps commemorating the World Cup, an international association football competition and a worldwide special event that is held every 4 years."
            },
            
            {
                "title": "As another way to show your dedication to real-life interests",
                "image": "https://www.stampworld.com/media/pages/to_show_dedication_to_real-life_interests.jpg",
                "content": "Some people collect stamps that feature a particular theme or item. For instance, a person who loves anything and everything about nature may only want to collect stamps that show animals and plants. Similarly, a fan of music may only collect stamps that portray famous musicians or anything that is associated with music such as musical instruments, musical genres, and composers."
            },
            
            {
                "title": "As an investment",
                "image": "https://www.stampworld.com/media/pages/stamps_as_an_investment.jpg",
                "content": "The first reason mentioned earlier, for some stamp collectors, does not apply to this one. There are some stamps that can be worth a fortune, but stamp collecting as an investment involves a high level of specialization, and in the opinion of most people, takes the fun factor out of it. No wonder why there is a distinction frequently drawn between stamp collectors and the so-called philatelic investors."
            },
            {
                "title": "Easy to store and does not take up too much space",
                "image": "https://www.stampworld.com/media/pages/easy_to_store.jpg",
                "content": "A stamp collector can collect as much as they can for decades, since there is no limit to collecting these wonderful pieces of paper, and the good thing is, no matter how many you collect, you can only use up a couple of shelves. Of course, there are other hobbies that have this 'small space storage' benefit, but only a select few have it clearly as stamps. Most of the collectibles are obviously far bigger and harder to store than postage stamps. A stamp collection containing thousands of stamps can be kept in just 1 album, whereas a collection of a thousand figurines takes up lots of rooms. This also means that when you have a stamp collection and you stopped collecting for reasons such as you are too busy, not interested anymore, or there were many other things that took up your time (this happens with almost all hobbies), it can easily be resumed anytime once you feel interested again."
            },
            
            {
                "title": "Describes one to be clean, neat, and orderly",
                "image": "https://www.stampworld.com/media/pages/clean%2C_neat_and_orderly.jpg",
                "content": "Orderliness is associated with cleanliness and comprehensiveness. Only a few hobbies have their own catalogs (such as comic book collecting) and none are as detailed as stamp catalogs. The fact of knowing what you exactly need is appealing to stamp collectors. Also, collecting stamps is neat and clean when compared to most collecting pastimes, and stamps fit in well with modern living situations."
            },
            {
                "title": "As a de-stressor to everyday life",
                "image": "https://www.stampworld.com/media/pages/stamp_collecting_is_cool.jpg",
                "content": "Some people collect stamps as a way to de-stress and unwind at the end of a rather stress-filled and busy day. The time spent searching and filling empty spaces in an album or simply looking at stamps help one to reduce the stress felt on that day. A lot of stamp collectors agree that their stamp albums are a marvelous brain-restorer. The most important benefit to continuing on collecting stamps even into your aging years, is that the hobby keeps your mind active, and an active mind is a young mind. Even if your body gets older and weaker, your mind does not need to. In fact, it should only get wiser and better with age."
            },
            {
                "title": "A perfect way to avoid boredom",
                "image": "https://www.stampworld.com/media/pages/a_perfect_way_to_avoid_boredom.jpg",
                "content": "Imagine what would people back in the olden days do without stamp collecting. For most people, the world would be a boring and less exciting place. Obviously, non-collectors will not understand, but for those who are really active in this hobby, they know that stamp collecting drives away the boredom in them, and it is a perfect solution to pass the time in a fun way during long winter evenings or rainy days. There is always something to do on a stamp collection -- it is always never finished."
            }
            

        ]
    },
    
    
    {
        "thumb": "https://www.thesprucecrafts.com/thmb/86bPnDqZzz5bLKhhXVfdTyGyIKg=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/98059276-57bc11065f9b58cdfdf16a89.jpg",
        "headline": "Know How and When to Turn Your Stamp Collection into Cash",
        "sub_headline": "Stamp collectors have the stuff and the somethings that are similar to securities (issued, as they are by governments) and provide liquidity as they are salable at a moment's notice to a ready and enthusiastic clientele.\n But don't forget that the sale of your stamps is dependent upon many things. Condition, rarity, demand (are they scarce enough to be strongly sought after?), as well as other considerations, will all affect your success when you go to sell.",
        "sections": [
            {
                "title": "Avoid a Mish-Mosh Stamp Accumulation",
                "image": "",
                "content": "One important factor that is often overlooked by the collector is organization. If you've been more a hoarder (perhaps more correctly an accumulator when one speaks of stamps) it might have a real impact on your reselling success. After all, if a buyer can't see your material, on what can he base his offer to you?\n Especially when you try to sell to stamp dealers, you must make sure everything is there to be easily seen. If it is otherwise, any premium items hidden in the mix will potentially be missed and uncounted. (This applies to bulk stamps and covers, packed in boxes and bags, what old-time dealers one called mish-mosh. On the other hand, if you are offering stamps in albums I assume you know what's in them, and can point out better items to a dealer, so he offers a better price.)"
            },
            
            {
                "title": "A Famous Stamp Accumulator",
                "image": "",
                "content": "There have been accumulators of note, among them Colonel E.H.R. Green, son of Hetty Green, the so-called Witch of Wall Street. With his remarkable wealth, he is said to have bought the entire stock of stamp stores on the spot. His appearance on Nassau Street in NYC, the center of stamp dealing for many years, would send dealers to their vaults to get out their finest material for Green to consider. Today he is best known as the buyer of the Inverted Jenny sheet, or as most non-collectors know it, the upside-down airplane stamp.\n Green's accumulation, when sold at auction, was featured in multiple sessions and realized stunning prices. The material's realizations were somewhat based -- beyond what the philatelic items may have been worth according to the catalog value -- on the fame of the former owner, a true star in the philatelic world at the time."
            },

            {
                "title": "The Allure of Unorganized Stamps",
                "image": "",
                "content": "If you are trying to sell to other collectors sometimes a messy lot of stamps and covers can do quite well. You can find ads in the philatelic press and online for Mystery Lots and Unsearched Collections. Part of the hype is that these are unsearched and that the buyer has an opportunity to find a treasure. Just don't forget the expression 'One person's treasure is another's trash' and consider what you're going in for when you purchase a Mystery Lot.\n Even if they are over-hyped they are yet another pleasure of the hobby. And yes, sometimes one can find an item that is far from a treasure but can nevertheless be of enough value that it alone can make the experience worthwhile."
            },
            
            {
                "title": "Clean Up a Family Stamp Collection",
                "image": "",
                "content": "When all is said and done, there are times of financial trouble, such as we are currently going through, when interest in simpler and cheaper pastimes is always welcome. Those who have an untended stamp collection in the family may go to the closet and get it out. They may consider their options -- some may take up the hobby.\n\n But with the price of a movie and its ephemeral entertainment, the relatively inexpensive cost of stamps may start to look like an option for a pleasant diversion. But if no one is interested in taking up the hobby, there should be no compunction in selling and tipping your hat to grandpa -- or whoever it originally belonged to -- in thanks for the windfall.\n\nIf it is not in the best state of the organization, you'll be doing yourself a favor by cleaning it up, making sure it has a good appearance, with the stamps well organized properly placed in the album, whether on pre-printed pages or arranged logically by country or topic in a stock book. Doing so will prove to be well worth your time."
            }

        ]
    },
    
    
    {
        "thumb": "https://www.thesprucecrafts.com/thmb/ltqi7pDEhZ9BHSdknNtDU9Vwa4A=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/american-flag-stamps-xxxl-165699482-9ed6fb7cee88419e9dd95e7c446ad49c.jpg",
        "headline": "How to Sell Stamps on eBay",
        "sub_headline": "Online auction services, especially eBay, have made it possible for any collector to become a stamp dealer. Get a catalog of your area, determine the catalog number, decide on a price of the item you're selling, list your item. Simple. In fact, you don't even need a catalog. Just search for the item on eBay and compare prices, and list it at what you believe your stamp or cover is worth based on comparison to similar items.\n\nIn actuality, it's not so simple. There is more to it than list it and sell it. Sometimes (i.e., frequently) a stamp is so common that it does not sell. So it is to your advantage that your stamp has more going for it than the average. Superior centering and pristine condition (no tears, gum stains, missing perforations, never hinged) will attract collectors looking to add a quality item to their collections. For an item that is clearly better than 90 percent of similar items offered, go with a higher starting price. If using Buy It Now (BIN), make the sale price catalog value or above. If your stamp is near perfect you will get your price.",
        "sections": [
            {
                "title": "The False Promise of Graded Stamps",
                "image": "",
                "content": "A recent trend is graded stamps; those that are graded highly and 'slabbed'—sealed in a plastic case—have been known to fetch prices many multiples of catalog value. Such grading first came to collectibles in the field of baseball cards, where companies like PSA and Beckett graded cards that collectors sent in, hoping for a high grade and a good payday. The bloom is off the rose of grading, both in baseball cards and stamps. The poor economy can be partially blamed, although in the world of philately graded stamps never got a foothold with collectors the way baseball cards did with their collectors."
            },
            
            {
                "title": "Finding and Bidding on Stamps on eBay",
                "image": "",
                "content": "You must use many methods for searching for stamps on eBay. The most obvious is to enter the country and catalog number. If you're bidding on U.S. stamps it is best to use the Scott catalog numbers; if British area stamps, use the Stanley Gibbons numbering system; if France, use Yvert catalog; if Germany, Michel. It is true that on the U.S. eBay site most worldwide stamps are listed by Scott catalog numbers./n Don't miss out on those listed by specialty catalog numbers. A good philatelic literature dealer will have the catalogs you need. You can also find catalogs at stamp supply dealers, like Subway./n You'll want to survey the stamp dealers on eBay, using their feedback score as a recommendation. Soon enough you'll find one that features the items you collect, in the condition you desire. As you are aware of the condition in your buying, it should be one of your primary concerns in selling."
            },
            
            {
                "title": "Selling Stamps",
                "image": "",
                "content": "While you know that as in selling real estate your top three considerations are location, location, and location; the same thing applies to the condition in stamp selling. Describe your item carefully—misdescribing is the easiest way to lose points when your buyers leave detailed feedback./n If you're selling stamps of a greater value (your price point is up to you; many prefer $100) you must have the stamp expertized as genuine by an expert. After all, you don't want an unhappy customer to return the stamp to you for a refund. And you certainly don't want the negative feedback that would accompany that return."
            },
            
            {
                "title": "Getting the Stamp to Your Customer",
                "image": "",
                "content": "Never use tape anywhere near the stamp when you pack the item to ship. Packing tape on the outside of the package is fine. Any sort of tape near a philatelic item is courting disaster. For stamps, use a poster board thickness stiffener around the stamps that you have already put into a clean approval card, which you've put into a plastic cover or self-sealing plastic bag. You can put tape on the outside of the stiffener, to tighten the package and keep the stamps in place during shipping.\nMany only use insurance for higher-priced items—over $50—though it's usually a good idea to use eBay's shipping service, which includes a USPS tracking number. Shipping stamps by UPS, unless it is a large lot, is cost-prohibitive."
            }
        ]
    },
    
    {
        "thumb": "https://www.thoughtco.com/thmb/QbeM1XL6Zu855X552CJp9-wLkhw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/166963448-F-56b005105f9b58b7d01f7e61.jpg",
        "headline": "Postage Stamp Design",
        "sub_headline": "Postage stamp design is a very important aspect in the production of stamps. It refers to the act of graphic designing (use of logos, images, shapes, color, and text) done on postage stamps. After the release of the first stamp in the world, the Penny Black (black 1 penny stamp which featured the head of Queen Victoria), several thousands of postage stamp designs were produced and released for use on mail as well as for collecting purposes.\n\nA postage stamp design is composed of many elements that are needed in order for it meet certain criteria and fulfill its function satisfactorily. The most essential part of a postage stamp design is its denomination showing its actual monetary value. As for the postage stamp design in other countries, they must adhere to international agreements and policies; thus, their country name must appear on almost every kind of stamps they release.\n\nA postage stamp design is typically deemed to be almost universal, and postage stamp customers basically assume stamps to bear a design.\n\nThere are 6 elements or parts that are very important in a postage stamp design:",
        "sections": [
            {
                "title": "1) Denomination",
                "image": "https://www.stampworld.com/media/pages/ireland_bird_dual_currency_stamp.jpg",
                "content": "A lot of people will agree that the main role of a stamp is to show the amount or denomination of the pre-payment of postage. Due to the fact that various sizes and types of letters/mail naturally pay varied sums of postage, the postage stamps are required to have a specific value or denomination.\nThe typical appearance of the value or denomination is simply a number, and it can be accompanied by a symbol of the currency which is placed either before or after it. Several postage stamps made in the early times show the denomination in words; however, the Universal Postal Union (UPU; special agency of the United Nations that coordinates postal policies worldwide) required that postage stamps used for international mail must utilize Arabic numerals (0, 1, 2, 3 and so on). This made any stamp's denomination easily identifiable, especially for people residing in foreign countries.\nThe postage stamp design of semipostal stamps typically shows 2 values or denominations, with a plus (+) sign in between them. The first denomination stands for the actual amount, and the second one stands for the extra amount that would be given to charity.\nIn some cases, you will encounter a particular country's stamp issues having a dual currency on its postage stamp design. An example would be the Ireland bird stamps issued on June 11, 2001, in which you will see the postage stamps in dual currency (Irish pound and Euro)."
            },
    
            {
                "title": "2) Country Name",
                "image": "https://www.stampworld.com/media/pages/south_africa_1990_birds.jpg",
                "content": "The second most important element of the postage stamp design is the country's name. This part of the postage stamp design is usually for stamps that are intended for international use.\nThe first ever postage stamps issued in the UK or United Kingdom bear no name of its country. In the year 1874, the UPU had exempted Great Britain regarding the rule in postage stamp design which declared that the name of the country must be written on their stamps. The visage of the king or queen was enough identification for Britain's postage stamps. Up until now, the United Kingdom is the one and only country that has no need to put its country name on its postage stamps. Click here to view the stamp catalogue of Great Britain. As for the other UPU countries, their country name must be written using the Latin alphabet (a, b, c, and so on).\nThe name selected is usually the name of the country, and because stamps are relatively small, some countries use shorter and simpler forms, or even abbreviations, in order to fit and look nicely on the postage stamp design. For example, the stamps of South Africa has an inscription of 'RSA'.\n There are some countries that have previous names such as that of Burkina Faso. Burkina Faso was formerly known as Upper Volta (in French, it is Haute-Volta) because the country is composed of the upper portion of the Volta river. The name was altered in 1984. The literal meaning of Burkina Faso is 'The Land of Upright People'.\nThere are some countries that are allowed to have multiple forms, from which the postage stamp designer may select the one he/she thinks is most suitable. The name may appear in its adjectival form, as in Posta Romana (Romanian Post) for Romania."
            },

            {
                "title": "3) Textual Elements",
                "image": "https://www.stampworld.com/media/pages/iraq_stamp.jpg",
                "content": "Almost all postage stamps have text placed in their postage stamp design. After the placement of denomination and country's name, the textual elements may contain a simple yet functional purpose (examples are: 'official mail', 'airmail', 'postage', etc.), the featured person's name, plate number (serial number of a printing plate; number printed in the margin of a sheet), the year when the stamp was issued, the event being commemorated, and even national mottoes.\nSometimes, a postage stamp design utilizes text as its main design element. For instance, some stamps of Pakistan use text as their main postage stamp design on their stamps. However, generally in many countries, the use of text as the main design element is sparingly done in the past few years.\nAs for countries that have multiple scripts and multiple languages, they may have to write these in many ways. For instance, stamps of Iraq have texts written in both Arabic and Latin characters.\nYou may see some stamps that also have written inscriptions found outside the margin. Most of them are constantly at the lower or bottom part, and it usually bears the designer and/or the name of the printer. Sometimes, a written description or narrative of the postage stamp design is located in the margin. In the past few years, the lower leftmost margin has turned into the most-preferred place to put in the year when the stamps were issued. Philatelists note these changes in the marginal inscriptions and regard them as distinctive kinds of stamps."
            },
            
            {
                "title": "Graphic Design",
                "image": "",
                "content": "The graphic element of a postage stamp design can be one of four major categories:\nA. Portrait bust -- can be the full face or a profile.\nB. Emblem -- flag, coat of arms, posthorn, national symbol, etc.\nC. Numeric -- a postage stamp design that is created around the numeral of denomination.\nD. Pictorial -- any image that ranges from animals and plants, to landscapes, to historical figures, to original artwork. Images may also be abstract designs, allegories or represent real-world objects.\nDifferent countries have different special rules that dictate the selection of the postage stamp design or design elements. For instance, stamps of the United Kingdom must show the monarch (usually as a silhouette), whereas stamps of the United States must not show any person who has been deceased for less than 10 years, with the only exception for former Presidents, who may be shown on a stamp 1 year after they died."
            },
            
            {
                "title": "5) Shape and Size",
                "image": "https://www.stampworld.com/media/pages/banana_stamp.jpg",
                "content": "The most common postage stamp's shape is a rectangle, because this is the most practical way to put stamps in a stamp sheet. A certain rectangle taller than wide is a vertical design, whereas wider than tall is called a horizontal design.\n Aside from rectangular stamps, you will also encounter other shapes of stamps such as triangles, octagons, circles, rhombuses, and other freestyle shapes including hearts and a stamp shaped like a banana which was issued from 1969-1985 in Tonga.\nThe most common size of a postage stamp is about 10 mm to 30 mm (millimeters), as these dimensions have proven to be the best and easiest size to handle.\nThe largest postage stamp in history was issued in the United States from 1865. Its size is 52 mm x 95 mm. These stamps were used solely for the mailing of newspapers.\nThe smallest postage stamp ever recorded was issued at Mecklenburg-Schwerin, a territory in Northern Germany."
            },
            
            {
                "title": "The Process of Making the Postage Stamp Design",
                "image": "",
                "content": "After choosing a subject, the postal administration usually contracts an artist to come up with a postage stamp design.\n In creating the postage stamp design, the stamp artist must follow all rules and limitations as mentioned previously. The artist may also be required to have sufficient credentials related to designing stamps. Furthermore, the artist has to consider the scenario of working with a rather tiny canvas. For instance, elaborate classic paintings often become vague and blurred when reduced in size; therefore, the stamp artist will choose an interesting or distinctive detail or aspect as the focal point of the postage stamp design. Likewise, a stamp that shows a portrait usually does not mean much to many customers, and the stamp artist may decide to insert a textual element implicating the person's accomplishments. An example would be an architect's famous building, or the artist will simply write down the word 'architect' someplace in the postage stamp design.\nAfter that, the artist shall submit one or two (or even more) stamp designs and the postal administration will review it for approval. Once approved, the postage stamp design may go through many stages of modification right before it enters the stamp production process. The postage stamp design might also be discarded, maybe if situations have changed, for example there is a change of government."
            }

        ]
    },
    
    
    {
        "thumb": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj9jUBlaNr-UxKtGn8Xos084gHZSPMZJZWw2Huy4xzf5qpNoz7oQu5O1v2j-GVT2pkudYgCKbKLSK2WxSKd489f0a6JV3AOXQf5q_qN-Ig-Xzh1kZ4uEdigf_tGmm_m5qLzz5p2qhNT_Wz2/s1600/43MO_0004.jpg",
        "headline": "Interesting recent issues",
        "sub_headline": "On May 17th, Alderney Postal Service issued a set of six stamps in a series on Alderney Scenes. Alderney has a great mix of beautiful nature and splendid architecture, and they have decided to celebrate this on the six stamps of this issue.\nThe six stamps depict scenes from around Alderney, and although the island is only 3.5 miles long, there is plenty to show.\nAs seen in the image above, Alderney has both nature and architecture, and to get a closer look at some of these sites, it might be an idea to take a trip there. The stamps are denominated between 44p and 90p.",
        "sections": [
            {
                "title": "Czech Republic - 75th anniversary of Operation Anthropoid:",
                "image": "",
                "content": "On May 17th as well, the Czech Republic issued this stamp, which features the 75th anniversary of Operation Anthropoid. the name Operation Anthropoid was a code name for an operation, with the purpose of assassinating the leader of the RSHA in the German Reich, Reinhard Heydrich, who was also a high-ranking member of the SS, and the Reichsprotektor in Bohemia and Morovia.\nHeydrich was a very powerful man in Germany at the time, and a confidant of Adolf Hitler. He was the man in charge of the Holocaust.\nHeydrich was attacked in Prague by supporters of the exiled Czechoslovakian government, Jozef Gabík and Jan Kubi. The attack took place on May 27 1942, when Heydrich's car was attacked by the two men. The attack did not proceed as planned, as Gabík's machine gun jammed, as he tried to shot Heydrich. Kubi threw a grenade at the car, injuring Heydrich, and the two men took off from the scene.\nHeydrich was injured by shrapnel in the attack, and brought to a hospital, where he died from his injuries about a week after the attack.\nThe death of Heydrich was heavily retaliated by the Nazis, who in the time following the attack, arrested more than 13,000 Czechs and executed more than 5,000 of them."
            }
        ]
    }
]
